package TRJavaHWs.lesson4;

public class Main {
    public static void main(String[] args) {
        int[] array = {1,2,3,4,5}; //expected 3.0
        System.out.println(ArithmeticMean.arithmeticMean(array));

        HowMany howMany = new HowMany();
        howMany.scan(); // Напишите программу HowMany.java, которая определит, сколько слов Вы ввели с консоли // 11


    }
}
